app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Testing Testing"], ["room_number", 123], ["created_at", "2020-11-18 19:06:39.772699"], ["updated_at", "2020-11-18 19:06:39.772699"]]
---
    def create
        @school_class = SchoolClass.create(school_classes_params(:title, :room_number))

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "school_classes" SET "title" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Yes 301"], ["updated_at", "2020-11-18 19:14:12.635091"], ["id", 1]]
---
    def update
        @school_class = SchoolClass.find(params[:id])
        @school_class.update(school_classes_params(:title, :room_number))