app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Kevin"], ["last_name", "Bacon"], ["created_at", "2020-11-18 19:30:37.772424"], ["updated_at", "2020-11-18 19:30:37.772424"]]
---
      def create
          @student = Student.create(students_params(:first_name, :last_name))